Power535/stm32-fdsemu/fatfs/src/diskio.c
	SPI_WriteByte(token);					/* Send token */
	if (token != 0xFD) {				/* Send data if token is other than StopTran */
		xmit_spi_multi(buff, 512);		/* Data */
		SPI_WriteByte(0xFF);
		SPI_WriteByte(0xFF);	/* Dummy CRC */

		resp = SPI_WriteByte(0xFF);				/* Receive data resp */
		if ((resp & 0x1F) != 0x05)		/* Function fails if the data packet was not accepted */
			return 0;
	}
	return 1;
}
#endif

/*-----------------------------------------------------------------------*/
/* Get Drive Status                                                      */
/*-----------------------------------------------------------------------*/

DSTATUS disk_status (
	BYTE pdrv		/* Physical drive nmuber to identify the drive */
)
{
	/* Check card detect pin if enabled */
	if (!SDCARD_IsDetected()) {
		return STA_NOINIT;
	}
	
	/* Check if write is enabled */
	if (!SDCARD_IsWriteEnabled()) {
		SD_Stat |= STA_PROTECT;
	} else {
		SD_Stat &= ~STA_PROTECT;
	}
	
	return SD_Stat;	/* Return disk status */
}



/*-----------------------------------------------------------------------*/
/* Inidialize a Drive                                                    */
/*-----------------------------------------------------------------------*/

DSTATUS disk_initialize (
	BYTE pdrv				/* Physical drive nmuber to identify the drive */
)
{
	BYTE n, cmd, ty, ocr[4];
	
	//Initialize CS pin
//	TM_FATFS_InitPins();
//	init_spi();
	
	if (!SDCARD_IsDetected()) {
		return STA_NODISK;
	}
	
	for (n = 10; n; n--) {
		SPI_WriteByte(0xFF);
	}
	ty = 0;
	if (SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0) == 1) {				/* Put the card SPI/Idle state */
//		TM_DELAY_SetTime2(1000);				/* Initialization timeout = 1 sec */
		if (SD_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA) == 1) {	/* SDv2? */
			for (n = 0; n < 4; n++) {
				ocr[n] = SPI_WriteByte(0xFF);	/* Get 32 bit return value of R7 resp */
			}
			if (ocr[2] == 0x01 && ocr[3] == 0xAA) {				/* Is the card supports vcc of 2.7-3.6V? */
				while (/*TM_DELAY_Time2() &&*/ SD_SendCmd(ACMD41, 1UL << 30)) ;	/* Wait for end of initialization with ACMD41(HCS) */
				if (/*TM_DELAY_Time2() &&*/ SD_SendCmd(CMD58, 0) == 0) {		/* Check CCS bit in the OCR */
					for (n = 0; n < 4; n++) {
						ocr[n] = SPI_WriteByte(0xFF);
					}
					ty = (ocr[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;	/* Card id SDv2 */
				}
			}
		} else {	/* Not SDv2 card */
			if (SD_SendCmd(ACMD41, 0) <= 1) 	{	/* SDv1 or MMC? */
				ty = CT_SD1; cmd = ACMD41;	/* SDv1 (ACMD41(0)) */
			} else {
				ty = CT_MMC; cmd = SD_CMD_SEND_OP_COND;	/* MMCv3 (CMD1(0)) */
			}
			while (/*TM_DELAY_Time2() &&*/ SD_SendCmd(cmd, 0));			/* Wait for end of initialization */
			if (/*TM_DELAY_Time2() ||*/ SD_SendCmd(SD_CMD_SET_BLOCKLEN, 512) != 0) {	/* Set block length: 512 */
				ty = 0;
			}
		}
	}
	SD_CardType = ty;	/* Card type */
	SD_Deselect();

	if (ty) {			/* OK */
		SD_Stat &= ~STA_NOINIT;	/* Clear STA_NOINIT flag */
	} else {			/* Failed */
		SD_Stat = STA_NOINIT;
	}

	if (!SDCARD_IsWriteEnabled()) {
		SD_Stat |= STA_PROTECT;
	} else {
		SD_Stat &= ~STA_PROTECT;
	}
	
	return SD_Stat;
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read (
	BYTE pdrv,		/* Physical drive nmuber to identify the drive */
	BYTE *buff,		/* Data buffer to store read data */
	DWORD sector,	/* Sector address in LBA */
	UINT count		/* Number of sectors to read */
)
{
	if (!SDCARD_IsDetected() || (SD_Stat & STA_NOINIT)) {
		return RES_NOTRDY;
	}

	if (!(SD_CardType & CT_BLOCK)) {
		sector *= 512;	/* LBA ot BA conversion (byte addressing cards) */
	}

	if (count == 1) {	/* Single sector read */
		if ((SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, sector) == 0)	/* READ_SINGLE_BLOCK */
			&& rcvr_datablock(buff, 512))
			count = 0;
	} else {				/* Multiple sector read */
		if (SD_SendCmd(SD_CMD_READ_MULT_BLOCK, sector) == 0) {	/* READ_MULTIPLE_BLOCK */
			do {
				if (!rcvr_datablock(buff, 512)) {
					break;
				}
				buff += 512;
			} while (--count);
			SD_SendCmd(SD_CMD_STOP_TRANSMISSION, 0);				/* STOP_TRANSMISSION */
		}
	}
	SD_Deselect();

	return count ? RES_ERROR : RES_OK;	/* Return result */
}



/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/

#if _USE_WRITE
DRESULT disk_write (
	BYTE pdrv,			/* Physical drive nmuber to identify the drive */
	const BYTE *buff,	/* Data to be written */
	DWORD sector,		/* Sector address in LBA */
	UINT count			/* Number of sectors to write */
)
{
#if 0
	if (!SDCARD_IsDetected()) {
		return RES_ERROR;
	}
	if (!SDCARD_IsWriteEnabled()) {
		return RES_WRPRT;
	}
	if (TM_FATFS_SD_Stat & STA_NOINIT) {
		return RES_NOTRDY;	/* Check drive status */
	}
	if (TM_FATFS_SD_Stat & STA_PROTECT) {
		return RES_WRPRT;	/* Check write protect */
	}

	if (!(TM_FATFS_SD_CardType & CT_BLOCK)) {
		sector *= 512;	/* LBA ==> BA conversion (byte addressing cards) */
	}

	if (count == 1) {	/* Single sector write */
		if ((send_cmd(CMD24, sector) == 0)	/* WRITE_BLOCK */
			&& xmit_datablock(buff, 0xFE))
			count = 0;
	} else {				/* Multiple sector write */
		if (TM_FATFS_SD_CardType & CT_SDC) send_cmd(ACMD23, count);	/* Predefine number of sectors */
		if (send_cmd(CMD25, sector) == 0) {	/* WRITE_MULTIPLE_BLOCK */
			do {
				if (!xmit_datablock(buff, 0xFC)) {
					break;
				}
				buff += 512;
			} while (--count);
			if (!xmit_datablock(0, 0xFD)) {	/* STOP_TRAN token */
				count = 1;
			}
		}
	}
	deselect();
#endif
	if (!SDCARD_IsDetected()) {
		return RES_ERROR;
	}
	if (!SDCARD_IsWriteEnabled()) {
		return RES_WRPRT;
	}
	if (SD_Stat & STA_NOINIT) {
		return RES_NOTRDY;	/* Check drive status */
	}
	if (SD_Stat & STA_PROTECT) {
		return RES_WRPRT;	/* Check write protect */
	}

	if (!(SD_CardType & CT_BLOCK)) {
		sector *= 512;	/* LBA ==> BA conversion (byte addressing cards) */
	}
	if (count == 1) {	/* Single sector write */
		if ((SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, sector) == 0)	/* WRITE_BLOCK */
			&& xmit_datablock(buff, 0xFE))
			count = 0;
	} else {				/* Multiple sector write */
		if (SD_CardType & CT_SDC)
			SD_SendCmd(SD_CMD_WRITE_MULT_BLOCK | 0x80, count);	/* Predefine number of sectors */
		if (SD_SendCmd(SD_CMD_WRITE_MULT_BLOCK, sector) == 0) {	/* WRITE_MULTIPLE_BLOCK */
			do {
				if (!xmit_datablock(buff, 0xFC)) {
					break;
				}
				buff += 512;
			} while (--count);
			if (!xmit_datablock(0, 0xFD)) {	/* STOP_TRAN token */
				count = 1;
			}
		}
	}
	SD_Deselect();

	return count ? RES_ERROR : RES_OK;	/* Return result */

